app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "start_at" = ?, "end_at" = ?, "allday" = ?, "memo" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "nisid"], ["start_at", "2021-10-23 01:33:00"], ["end_at", "2021-10-29 23:29:00"], ["allday", "1"], ["memo", "cv "], ["updated_at", "2021-10-14 14:29:48.989534"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

INSERT INTO "posts" ("title", "allday", "created_at", "updated_at", "memo") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["allday", "0"], ["created_at", "2022-03-19 16:55:03.516997"], ["updated_at", "2022-03-19 16:55:03.516997"], ["memo", ""]]
---
  def create
     @post = Post.create(post_params)